src/Documents/ЗакрытиеМесяца.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗакрытиеМесяца</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>Клиника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцРаспределения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ЗакрытиеМесяца/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаЗаполнения" объекта
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;

	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура - обработчик события "ПриКопировании" объекта
//
Процедура ПриКопировании(ОбъектКопирования)
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	                       
КонецПроцедуры

// Обработчик перед записью документа
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка существования документа закрывающего данный месяц
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ЗакрытиеМесяца.Ссылка
		|ИЗ
		|	Документ.ЗакрытиеМесяца КАК ЗакрытиеМесяца
		|ГДЕ
		|	ГОД(ЗакрытиеМесяца.МесяцРаспределения) = ГОД(&МесяцРаспределения)
		|	И ЗакрытиеМесяца.Проведен = ИСТИНА
		|	И МЕСЯЦ(ЗакрытиеМесяца.МесяцРаспределения) = МЕСЯЦ(&МесяцРаспределения)
		|	И ЗакрытиеМесяца.Ссылка <> &ИсключитьСсылку
		|	И ЗакрытиеМесяца.СтруктурнаяЕдиница = &СтруктурнаяЕдиница");
		
		Запрос.УстановитьПараметр("МесяцРаспределения",ЭтотОбъект.МесяцРаспределения);
		Запрос.УстановитьПараметр("ИсключитьСсылку",ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ЭтотОбъект.СтруктурнаяЕдиница);
		РезВыборки = Запрос.Выполнить().Выбрать();
		Если РезВыборки.Количество() > 0 Тогда
			РезВыборки.Следующий();
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("" + РезВыборки.Ссылка	+" документ закрывает указаный месяц!");	 
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

// Обработчик проведени объекта
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Инициализация дополнительных свойств для проведения документа.
	ДвиженияДокументовСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);		
    // Инициализация данных документа.	
	Документы.ЗакрытиеМесяца.УстановитьНачальныеДанныеДокумента(Ссылка, ДополнительныеСвойства);		
	// Движения по регистрам
	ДвиженияДокументовСервер.Управленческий(ДополнительныеСвойства, Движения, Отказ);	
    // Запись наборов записей.
	ДвиженияДокументовСервер.ДобавитьНаборыЗаписей(ЭтотОбъект);	

КонецПроцедуры


#КонецОбласти
